const projetData = [
    {
        "nom": "Intégration d'une maquette responsive",
        "techno":["HTML","CSS","Responsive", "GitHub"] ,
        "url": "https://github.com/speedcore12/OC_P2",
        "img": "/images/projets/P2.webp",
        "description" : "Ce projet consiste à intégrer une maquette responsive en HTML et CSS, en respectant les normes d'accessibilité et les bonnes pratiques de développement, en utilisant Visual Studio Code pour le développement, et GitHub pour la gestion de version.",
    },
    {
        "nom": "Création d'une Interface Web Dynamique",
        "techno":["HTML","CSS","JS", "API RESTful", "GitHub"] ,
        "url": "https://github.com/speedcore12/OC_P3",
        "img": "/images/projets/P3.webp",
        "description" : "Ce projet utilise JavaScript pour gérer les interactions utilisateur et manipuler le DOM, en intégrant une API pour la communication avec le back-end, avec l'aide de Figma pour les maquettes, Visual Studio Code pour le développement, et GitHub pour la gestion de version.",
    },
    {
        "nom": "Optimisation SEO et Accessibilité : Analyse et Améliorations",
        "techno":["HTML","CSS","JS", "SEO", "Accessibilité", "GitHub"] ,
        "url": "https://github.com/speedcore12/OC_P4",
        "img": "/images/projets/P4.webp",
        "description" : "Ce projet consiste à améliorer le référencement naturel d'un site web et à garantir l'accessibilité de celui-ci, en utilisant les outils de développement et de validation et en utilisant GitHub pour la gestion de version.",
    },{
        "nom": "Développement d'une Application avec React et React Router",
        "techno":["React", "React Router", "SCSS", "GitHub"] ,
        "url": "https://github.com/speedcore12/OC_P5",
        "img": "/images/projets/P5.webp",
        "description" : "Ce projet consiste à développer une application web dynamique avec React, en utilisant React Router pour la navigation en utilisant GitHub pour la gestion de version.",
    },
    {
        "nom": "Développement du Back-End avec Node.js, Express, et MongoDB",
        "techno":["Node.js", "Express", "MongoDB", "GitHub"] ,
        "url": "https://github.com/speedcore12/OC_P6",
        "img": "/images/projets/P6.webp",
        "description" : "Ce projet consiste à développer le back-end d'une application web dynamique avec Node.js, Express, et MongoDB, implémenterez des opérations CRUD sécurisées, en utilisant GitHub pour la gestion de version.",
    }];